security/base/src/test/resources/org/switchyard/security/credential/extractor/SOAPMessageCredentialExtractorTests-UsernameToken.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope
    xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
    xmlns:test="urn:switchyard-security:test-username-token:0.1.0">
    <soap:Header>
        <wsse:Security>
            <wsse:UsernameToken>
                <wsse:Username>Aladdin</wsse:Username>
                <wsse:Password>open sesame</wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
    </soap:Header>
    <soap:Body>
        <test:foo>bar</test:foo>
    </soap:Body>
</soap:Envelope>
